# RoomTooShort Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..RoomTooShort Property
BuiltInFailures..::..RoomFailures Class See Also
---
[Room] is very short. If this is not intended, change its Upper Limit and Offset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoomTooShort { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomTooShort As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoomTooShort {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace